# Отчет по лабораторной работе №1
## Минин Арсений, группа P3132
### Задание 
Написать программу на языке Java, выполняющую соответствующие варианту действия. Программа должна соответствовать следующим требованиям:

1. Она должна быть упакована в исполняемый jar-архив.
2. Выражение должно вычисляться в соответствии с правилами вычисления математических выражений (должен соблюдаться порядок выполнения действий и т.д.).
3. Программа должна использовать математические функции из стандартной библиотеки Java.
4. Результат вычисления выражения должен быть выведен в стандартный поток вывода в заданном формате.

Выполнение программы необходимо продемонстрировать на сервере helios.

Вариант: 2211
1. Создать одномерный массив c типа short. Заполнить его числами от 2 до 17 включительно в порядке убывания.
2. Создать одномерный массив x типа float. Заполнить его 16-ю случайными числами в диапазоне от -8.0 до 14.0.
3. Создать двумерный массив c размером 16x16. Вычислить его элементы по следующей формуле (где x = x[j]):
    - если c[i] = 4, то
   $$c[i][j] = ( \frac {1}{3} +  ( ( \frac {4}{x} )^{2} )^{ \arctan( \frac {x+3}{22})*(e^{x} + 3) })^{2};$$
    - если c[i] ∈ {2, 5, 7, 10, 11, 12, 13, 17}, то
      $$c[i][j] = ( \frac {1}{4} / e^{ \ln (|x|)})^{3};$$
    - для остальных значений c[i]:  
      $$c[i][j] = \frac {1}{4} / ( ( \sqrt[3]{x} )^{ 2 * 2 * x } * ( \ln (|x|) + \frac {2}{3} ))^{2}.$$
4. Напечатать полученный в результате массив в формате с пятью знаками после запятой.

### Исходный код программы
```java
import static java.lang.Math.*;
public class lab1prg {
    public static boolean ifIn(int c) {
        int[] elem = {2,5,7,10,11,12,13,17};
        for (int i: elem) {
            if (i==c) {
                return true;
            }
        }
        return false;
    }
    public static void main(String[] args) {
        short[] c = new short[]{17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2};
        float[] x = new float[16];
        for (int i=0; i<16; i++) {
            float x[i] = (Math.random()*22-8);
        }


        double[][] r = new double[16][16];

        for (int qi = 0; qi<c.length; qi++) {
            for (int qj =0; qj<x.length; qj++) {
                if (c[qi] == 4) {
                    r[qi][qj] = Math.pow((1/3 + Math.pow(abs(4/x[qj]), 2*Math.atan((x[qj]+3)/22)*(Math.exp(x[qj])+3))), 2);
                } else if (ifIn(c[qi])) {
                    r[qi][qj] = Math.pow((1/(4*Math.exp(Math.log(abs(x[qj]))))), 3);
                } else {
                    r[qi][qj] = 1/(4*(Math.pow(Math.pow(cbrt(x[qj]), 2*2*x[qj])*(log(abs(x[qj])) +2/3) ,2)));
                }
            }
        }

        for (double[] ri: r) {
            for (double rij: ri) {
                if (Double.isNaN(rij)) {
                    System.out.printf("%1$12s"," NaN");
                } else {
                    System.out.printf(" "+"%.5e", rij);

                }
            }
            System.out.println();
        }


    }
}
```
Пример вывода программы: 

 <table>
 <tr><td>
 6,70973e-06 4,57728e-05 8,64687e-04 7,95688e-05 1,77675e-04 1,92306e-04 2,02453e-04 3,05664e-02 2,52532e+00 2,64515e-02 6,62044e-04 1,96505e-04 1,24385e-05 1,05111e-04 4,42930e-04 5,16571e-05 </td></tr>
 <tr><td>
 7,97748e-42         NaN         NaN         NaN 2,31813e-09 5,16427e-09 8,56398e-09 8,05050e+00 1,99505e-01 1,20227e+01 7,10988e-05 6,39565e-09 8,36082e-32 5,31821e-12 5,45999e-06 1,08826e-16  </td></tr>
 <tr><td>
 7,97748e-42         NaN         NaN         NaN 2,31813e-09 5,16427e-09 8,56398e-09 8,05050e+00 1,99505e-01 1,20227e+01 7,10988e-05 6,39565e-09 8,36082e-32 5,31821e-12 5,45999e-06 1,08826e-16  </td></tr>
 <tr><td>
 7,97748e-42         NaN         NaN         NaN 2,31813e-09 5,16427e-09 8,56398e-09 8,05050e+00 1,99505e-01 1,20227e+01 7,10988e-05 6,39565e-09 8,36082e-32 5,31821e-12 5,45999e-06 1,08826e-16  </td></tr>
 <tr><td>
 6,70973e-06 4,57728e-05 8,64687e-04 7,95688e-05 1,77675e-04 1,92306e-04 2,02453e-04 3,05664e-02 2,52532e+00 2,64515e-02 6,62044e-04 1,96505e-04 1,24385e-05 1,05111e-04 4,42930e-04 5,16571e-05  </td></tr>
 <tr><td>
 6,70973e-06 4,57728e-05 8,64687e-04 7,95688e-05 1,77675e-04 1,92306e-04 2,02453e-04 3,05664e-02 2,52532e+00 2,64515e-02 6,62044e-04 1,96505e-04 1,24385e-05 1,05111e-04 4,42930e-04 5,16571e-05  </td></tr>
 <tr><td>
 6,70973e-06 4,57728e-05 8,64687e-04 7,95688e-05 1,77675e-04 1,92306e-04 2,02453e-04 3,05664e-02 2,52532e+00 2,64515e-02 6,62044e-04 1,96505e-04 1,24385e-05 1,05111e-04 4,42930e-04 5,16571e-05  </td></tr>
 <tr><td>
 6,70973e-06 4,57728e-05 8,64687e-04 7,95688e-05 1,77675e-04 1,92306e-04 2,02453e-04 3,05664e-02 2,52532e+00 2,64515e-02 6,62044e-04 1,96505e-04 1,24385e-05 1,05111e-04 4,42930e-04 5,16571e-05  </td></tr>
 <tr><td>
 7,97748e-42         NaN         NaN         NaN 2,31813e-09 5,16427e-09 8,56398e-09 8,05050e+00 1,99505e-01 1,20227e+01 7,10988e-05 6,39565e-09 8,36082e-32 5,31821e-12 5,45999e-06 1,08826e-16  </td></tr>
 <tr><td>
 7,97748e-42         NaN         NaN         NaN 2,31813e-09 5,16427e-09 8,56398e-09 8,05050e+00 1,99505e-01 1,20227e+01 7,10988e-05 6,39565e-09 8,36082e-32 5,31821e-12 5,45999e-06 1,08826e-16  </td></tr>
 <tr><td>
 6,70973e-06 4,57728e-05 8,64687e-04 7,95688e-05 1,77675e-04 1,92306e-04 2,02453e-04 3,05664e-02 2,52532e+00 2,64515e-02 6,62044e-04 1,96505e-04 1,24385e-05 1,05111e-04 4,42930e-04 5,16571e-05  </td></tr>
 <tr><td>
 7,97748e-42         NaN         NaN         NaN 2,31813e-09 5,16427e-09 8,56398e-09 8,05050e+00 1,99505e-01 1,20227e+01 7,10988e-05 6,39565e-09 8,36082e-32 5,31821e-12 5,45999e-06 1,08826e-16  </td></tr>
 <tr><td>
 6,70973e-06 4,57728e-05 8,64687e-04 7,95688e-05 1,77675e-04 1,92306e-04 2,02453e-04 3,05664e-02 2,52532e+00 2,64515e-02 6,62044e-04 1,96505e-04 1,24385e-05 1,05111e-04 4,42930e-04 5,16571e-05  </td></tr>
 <tr><td>
 0,00000e+00 3,32482e+00 1,09254e+00 1,76962e+00 4,92527e-06 3,06674e-04 2,85640e-03 3,15490e+02 1,70647e+03 3,09641e+02 1,26891e+03 8,14590e-04 0,00000e+00 2,02940e-36 6,84845e+02 1,72268e-309  </td></tr>
 <tr><td>
 7,97748e-42         NaN         NaN         NaN 2,31813e-09 5,16427e-09 8,56398e-09 8,05050e+00 1,99505e-01 1,20227e+01 7,10988e-05 6,39565e-09 8,36082e-32 5,31821e-12 5,45999e-06 1,08826e-16  </td></tr>
 <tr><td>
 6,70973e-06 4,57728e-05 8,64687e-04 7,95688e-05 1,77675e-04 1,92306e-04 2,02453e-04 3,05664e-02 2,52532e+00 2,64515e-02 6,62044e-04 1,96505e-04 1,24385e-05 1,05111e-04 4,42930e-04 5,16571e-05 </td></tr></table> 

NaN возникают при отрицательных x в 3-ей формуле, конкретно в $$(\sqrt[3]{x})^{ 2 * 2 * x},$$ так как отрицательное число возводится в нецелую степень.

### Выводы
Работать с Java в первый раз было интересно, хоть и немного трудно. Писать выводы в отчетах скучно.





 
