# Отчет по лабораторной работе №1
## Минин Арсений, группа P3132
### Задание 
Написать программу на языке Java, выполняющую соответствующие варианту действия. Программа должна соответствовать следующим требованиям:

1. Она должна быть упакована в исполняемый jar-архив.
2. Выражение должно вычисляться в соответствии с правилами вычисления математических выражений (должен соблюдаться порядок выполнения действий и т.д.).
3. Программа должна использовать математические функции из стандартной библиотеки Java.
4. Результат вычисления выражения должен быть выведен в стандартный поток вывода в заданном формате.

Выполнение программы необходимо продемонстрировать на сервере helios.

Вариант: 2211
1. Создать одномерный массив c типа short. Заполнить его числами от 2 до 17 включительно в порядке убывания.
2. Создать одномерный массив x типа float. Заполнить его 16-ю случайными числами в диапазоне от -8.0 до 14.0.
3. Создать двумерный массив c размером 16x16. Вычислить его элементы по следующей формуле (где x = x[j]):
    - если c[i] = 4, то
   $$c[i][j] = ( \frac {1}{3} +  ( ( \frac {4}{x} )^{2} )^{ \arctan( \frac {x+3}{22})*(e^{x} + 3) })^{2};$$
    - если c[i] ∈ {2, 5, 7, 10, 11, 12, 13, 17}, то
      $$c[i][j] = ( \frac {1}{4} / e^{ \ln (|x|)})^{3};$$
    - для остальных значений c[i]:  
      $$c[i][j] = \frac {1}{4} / ( ( \sqrt[3]{x} )^{ 2 * 2 * x } * ( \ln (|x|) + \frac {2}{3} ))^{2}.$$
4. Напечатать полученный в результате массив в формате с пятью знаками после запятой.

### Исходный код программы
```java
import static java.lang.Math.*;
public class lab1prg {
    public static boolean ifIn(int c) {
        int[] elem = {2,5,7,10,11,12,13,17};
        for (int i: elem) {
            if (i==c) {
                return true;
            }
        }
        return false;
    }
    public static void main(String[] args) {
        short[] c = new short[]{17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2};
        float[] x = new float[16];
        for (int i=0; i<16; i++) {
            float x[i] = (Math.random()*22-8);
        }


        double[][] r = new double[16][16];

        for (int qi = 0; qi<c.length; qi++) {
            for (int qj =0; qj<x.length; qj++) {
                if (c[qi] == 4) {
                    r[qi][qj] = Math.pow((1/3 + Math.pow(abs(4/x[qj]), 2*Math.atan((x[qj]+3)/22)*(Math.exp(x[qj])+3))), 2);
                } else if (ifIn(c[qi])) {
                    r[qi][qj] = Math.pow((1/(4*Math.exp(Math.log(abs(x[qj]))))), 3);
                } else {
                    r[qi][qj] = 1/(4*(Math.pow(Math.pow(cbrt(x[qj]), 2*2*x[qj])*(log(abs(x[qj])) +2/3) ,2)));
                }
            }
        }

        for (double[] ri: r) {
            for (double rij: ri) {
                if (Double.isNaN(rij)) {
                    System.out.printf("%1$11s"," NaN");
                } else {
                    System.out.printf("  %1$9.5f", rij);

                }
            }
            System.out.println();
        }


    }
}
```
Пример вывода программы: 

 0,00083    0,00010    0,00244    0,00410    0,01760    0,00001    0,00010    0,21863    0,00002    0,00068    0,00012    0,00009    0,00005    0,00019    0,00002    0,00004
        NaN        NaN        NaN        NaN        NaN    0,00000        NaN        NaN    0,00000        NaN    0,00000        NaN    0,00000        NaN    0,00000        NaN
        NaN        NaN        NaN        NaN        NaN    0,00000        NaN        NaN    0,00000        NaN    0,00000        NaN    0,00000        NaN    0,00000        NaN
        NaN        NaN        NaN        NaN        NaN    0,00000        NaN        NaN    0,00000        NaN    0,00000        NaN    0,00000        NaN    0,00000        NaN
    0,00083    0,00010    0,00244    0,00410    0,01760    0,00001    0,00010    0,21863    0,00002    0,00068    0,00012    0,00009    0,00005    0,00019    0,00002    0,00004
    0,00083    0,00010    0,00244    0,00410    0,01760    0,00001    0,00010    0,21863    0,00002    0,00068    0,00012    0,00009    0,00005    0,00019    0,00002    0,00004
    0,00083    0,00010    0,00244    0,00410    0,01760    0,00001    0,00010    0,21863    0,00002    0,00068    0,00012    0,00009    0,00005    0,00019    0,00002    0,00004
    0,00083    0,00010    0,00244    0,00410    0,01760    0,00001    0,00010    0,21863    0,00002    0,00068    0,00012    0,00009    0,00005    0,00019    0,00002    0,00004
        NaN        NaN        NaN        NaN        NaN    0,00000        NaN        NaN    0,00000        NaN    0,00000        NaN    0,00000        NaN    0,00000        NaN
        NaN        NaN        NaN        NaN        NaN    0,00000        NaN        NaN    0,00000        NaN    0,00000        NaN    0,00000        NaN    0,00000        NaN
    0,00083    0,00010    0,00244    0,00410    0,01760    0,00001    0,00010    0,21863    0,00002    0,00068    0,00012    0,00009    0,00005    0,00019    0,00002    0,00004
        NaN        NaN        NaN        NaN        NaN    0,00000        NaN        NaN    0,00000        NaN    0,00000        NaN    0,00000        NaN    0,00000        NaN
    0,00083    0,00010    0,00244    0,00410    0,01760    0,00001    0,00010    0,21863    0,00002    0,00068    0,00012    0,00009    0,00005    0,00019    0,00002    0,00004
    1,07985    1,42928    1,65499    2,20003    5,94849    0,00000    1,45004   48,43574    0,00000    1,03036    0,00000    1,63188    0,00000    1,06420    0,00000    3,59722
        NaN        NaN        NaN        NaN        NaN    0,00000        NaN        NaN    0,00000        NaN    0,00000        NaN    0,00000        NaN    0,00000        NaN
    0,00083    0,00010    0,00244    0,00410    0,01760    0,00001    0,00010    0,21863    0,00002    0,00068    0,00012    0,00009    0,00005    0,00019    0,00002    0,00004

NaN возникают при отрицательных x в 3-ей формуле, конкретно в $$(\sqrt[3]{x})^{ 2 * 2 * x},$$ так как отрицательное число возводится в нецелую степень.

### Выводы
Работать с Java в первый раз было интересно, хоть и немного трудно. Писать выводы в отчетах скучно.





 
